# Updating Rows and Columns

In [1]:
import pandas as pd

In [2]:
people = {'name' : ['abhi','abc', 'mark'],
         'surname': ['joshi','xyz', 'tolan'],
         'Hobby':['play','sing','dance']}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   name surname  Hobby
0  abhi   joshi   play
1   abc     xyz   sing
2  mark   tolan  dance

### To Update the column names 
### ( To change all columns only)

#### Change lowercase to uppercase

In [5]:
df.columns = ['NAME','SURNAME','HOBBY']

In [6]:
df

   NAME SURNAME  HOBBY
0  abhi   joshi   play
1   abc     xyz   sing
2  mark   tolan  dance

#### Change column names itself

In [7]:
df.columns = ['first_name','last_name','hobby']

In [8]:
df

  first_name last_name  hobby
0       abhi     joshi   play
1        abc       xyz   sing
2       mark     tolan  dance

#### Using list comprehension to make first letter as uppercase

In [9]:
df.columns = [x.capitalize() for x in df.columns]

In [10]:
df

  First_name Last_name  Hobby
0       abhi     joshi   play
1        abc       xyz   sing
2       mark     tolan  dance

#### To replace underscore with space

In [11]:
df.columns = [x.replace('_',' ') for x in df.columns]

In [12]:
df

  First name Last name  Hobby
0       abhi     joshi   play
1        abc       xyz   sing
2       mark     tolan  dance

#### Making column names back to normal

In [13]:
df.columns = ['first','last','hobby']

In [14]:
df

  first   last  hobby
0  abhi  joshi   play
1   abc    xyz   sing
2  mark  tolan  dance

### To change only some columns heading
#### Use rename method, pass dictionary of before name and after name

In [15]:
df.rename(columns={'first':'first_name','last':'last_name'})

  first_name last_name  hobby
0       abhi     joshi   play
1        abc       xyz   sing
2       mark     tolan  dance

In [16]:
df # changes are not permanent, use inplace=True

  first   last  hobby
0  abhi  joshi   play
1   abc    xyz   sing
2  mark  tolan  dance

In [17]:
df.rename(columns={'first':'first_name','last':'last_name'}, inplace=True)

In [18]:
df

  first_name last_name  hobby
0       abhi     joshi   play
1        abc       xyz   sing
2       mark     tolan  dance

### To change actual data

In [19]:
df

  first_name last_name  hobby
0       abhi     joshi   play
1        abc       xyz   sing
2       mark     tolan  dance

#### To change entire row

In [20]:
df.loc[2] = ['Azure','Interior','Cricket']

In [21]:
df

  first_name last_name    hobby
0       abhi     joshi     play
1        abc       xyz     sing
2      Azure  Interior  Cricket

#### To change row at certain columns only

In [22]:
df.loc[1,['last_name','hobby']] = ['Musk','Space']

In [23]:
df

  first_name last_name    hobby
0       abhi     joshi     play
1        abc      Musk    Space
2      Azure  Interior  Cricket

#### To change only one value at given row and column

In [24]:
df.loc[1,'first_name'] = 'Elon'

In [25]:
df

  first_name last_name    hobby
0       abhi     joshi     play
1       Elon      Musk    Space
2      Azure  Interior  Cricket

In [26]:
# or 
df.loc[1].first_name = 'ELON'

In [27]:
df

  first_name last_name    hobby
0       abhi     joshi     play
1       ELON      Musk    Space
2      Azure  Interior  Cricket

In [28]:
# or, using at method
df.at[1,'last_name'] = 'MUSK'

In [29]:
df

  first_name last_name    hobby
0       abhi     joshi     play
1       ELON      MUSK    Space
2      Azure  Interior  Cricket

#### If we try to change the value using filter then it will throw warning

In [30]:
filt = (df['hobby'] == 'Space')

In [31]:
filt

0    False
1     True
2    False
Name: hobby, dtype: bool

In [32]:
df[filt]

  first_name last_name  hobby
1       ELON      MUSK  Space

In [33]:
df[filt]['hobby'] = 'space'

/tmp/ipykernel_4247/774994395.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['hobby'] = 'space'

#### So we can use loc or iloc and 'at' method to change the value

In [34]:
df.loc[filt, 'hobby'] = 'space'

In [35]:
df

  first_name last_name    hobby
0       abhi     joshi     play
1       ELON      MUSK    space
2      Azure  Interior  Cricket

### To change value of entire column

### Method 1

In [36]:
df['hobby'] = df['hobby'].str.upper()

In [37]:
df

  first_name last_name    hobby
0       abhi     joshi     PLAY
1       ELON      MUSK    SPACE
2      Azure  Interior  CRICKET

### Method 2 : using apply, apply is used to calling function on a value of DataFrame or Series

#### Applying on Series

#### Example: get len of hobby column

In [38]:
df['hobby'].apply(len)

0    4
1    5
2    7
Name: hobby, dtype: int64

#### Here len is inbuilt function, we can use custom function as well

In [41]:
def cap_last(last_name):
    return last_name.upper()

In [44]:
df['last_name'].apply(cap_last)

0       JOSHI
1        MUSK
2    INTERIOR
Name: last_name, dtype: object

#### to make changes permanently,

In [45]:
df['last_name'] = df['last_name'].apply(cap_last)

In [46]:
df

  first_name last_name    hobby
0       abhi     JOSHI     PLAY
1       ELON      MUSK    SPACE
2      Azure  INTERIOR  CRICKET

#### Using lambda function

In [47]:
df['last_name'] = df['last_name'].apply(lambda x: x.lower())

In [48]:
df

  first_name last_name    hobby
0       abhi     joshi     PLAY
1       ELON      musk    SPACE
2      Azure  interior  CRICKET

#### Applying apply on DataFrame: Below len function does not get applied on each data rather than it collects length of data each column has, len(df['first_name']) -->3, len(df['last_name']) -->3

In [52]:
df.apply(len)

first_name    3
last_name     3
hobby         3
dtype: int64

#### To apply given function on each element of DataFrame, use applymap method

### Method 3: Use of applymap, use only on DataFrame

In [54]:
df

  first_name last_name    hobby
0       abhi     joshi     PLAY
1       ELON      musk    SPACE
2      Azure  interior  CRICKET

In [55]:
df.applymap(len)

   first_name  last_name  hobby
0           4          5      4
1           4          4      5
2           5          8      7

In [56]:
df.applymap(cap_last)

  first_name last_name    hobby
0       ABHI     JOSHI     PLAY
1       ELON      MUSK    SPACE
2      AZURE  INTERIOR  CRICKET

In [57]:
df

  first_name last_name    hobby
0       abhi     joshi     PLAY
1       ELON      musk    SPACE
2      Azure  interior  CRICKET

### Method 4: Use of map, use only on Series

In [61]:
df

  first_name last_name    hobby
0       abhi     joshi     PLAY
1       ELON      musk    SPACE
2      Azure  interior  CRICKET

In [62]:
df['hobby'].map(len)

0    4
1    5
2    7
Name: hobby, dtype: int64

In [65]:
df['hobby'].map(str.lower)

0       play
1      space
2    cricket
Name: hobby, dtype: object

#### Map can be used to substitute value with other values

In [68]:
df

  first_name last_name    hobby
0       abhi     joshi     PLAY
1       ELON      musk    SPACE
2      Azure  interior  CRICKET

In [69]:
df['hobby'].map({'PLAY':'game','SPACE':'car'})

0    game
1     car
2     NaN
Name: hobby, dtype: object

#### Here above, as we are not passing replacement value for cricket thus we are getting NaN value, to avoid this replace method can be used

### Method 5: Using replace method

In [70]:
df

  first_name last_name    hobby
0       abhi     joshi     PLAY
1       ELON      musk    SPACE
2      Azure  interior  CRICKET

In [71]:
df['hobby'].replace({'PLAY':'game','SPACE':'car'})

0       game
1        car
2    CRICKET
Name: hobby, dtype: object